[
    "There is telling of a dangerous cave nearby, holding immense riches. ",
    "There is a rumor of riches stored in a nearby cave. ",
    "You found a small clearing. ",
    "A bridge crosses over a deep gorge. ",
    "This town's inn looks very inviting. ",
    "A trail winds up the side of a mountain. ",
    "You hear a rumor of a treasure outside the town. ",
    "You found a clearing with sunshine streaming in from above. ",
    "The remains of some sort of ritual can be found ahead. ",
    "There is rumor of an adventurer's demise over the next hill. ",
    "A small path can be seen heading into some brush. ",
    "An overgrown grove lies ahead. ",
    "A deserted ritual space can be seen ahead. ",
    "The path widens and there is a small field. ",
    "You spy an ancient-looking chest resting against a tree. ",
    "The path ahead winds down into a valley below. ",
    "The birds and animals around you suddenly have gone silent. ",
    "There is a rumor that a rich dragon lives nearby. ",
    "You stumble upon a small grotto. ",
    "A thin, rickety wooden bridge stretches across a canyon. ",
    "You find a cave entrance covered in moss. ",
    "Thin tendrils of fog are starting to creep across the path. ",
    "There is a rumor of an ancient treasure nearby. ",
    "A small glittering object can be seen ahead on the side of the path. ",
    "The path opens up into a clearing, and fresh bones can be seen in the grass. ",
    "The path starts to thin and the trees feel like they are starting to reach towards you. ",
    "A mossy stone altar can be seen ahead. ",
    "A massive, short block of intricately-carved stone can be seen on the side of the path. ",
    "You hear a strange noise, unlike any animal you've heard before. ",
    "The birds suddenly stop singing and the silence in the forest is deafening. An open clearing lies ahead. ",
    "Rusty metal scraps are strewn about on the path ahead. ",
    "You stumble across the very fresh remains of another unfortunate adventurer. ",
    "A small trail winds deeper into the forest. "
    "The wind whistles strange sounds into your ears. Beware of what is to come."
    "A flock of black clouds are coming your way. The gods have forsaken you."
    "You can hear thunderclouds not far off in the distance."
    "The earth starts to crumble underneath your feet. Trees fall to the ground."
    "You see animals rushing towards you but not caring about your existence, what could it be they are running from?"
    "You hear echoes of crackling stone coming closer. Throwing your torch deep into the cave you realize something big must be coming."
    "After a rough day climbing the mountain you take a nap just to find yourself caught off guard."
    "In the tavern they laughed at you for taking on this quest. You better show them what you are made of."
    "The red X marks the spot. Surely this map isn't a sham."
    "Years of training just for this moment."
    "Decades of adventuring and i'm still alive. That better not change today."
    "We can do this, together!"
    "Don't get scared now!"
    "Time to impress the townsfolk."
    "I beat that when i was half your age."
    "You smell something strange. A foul odour envelopes the whole are."
    "You feel a cold shudder running down your spine."
    "You. Shall. Not. Pass."
    "While climbing the tower your weapon starts to glow in a shimmering blue light, ENEMY INCOMING."
    "A mysterious portal appears infront of you. Are you brave enough?"
    "A rainy sunday afternoon has you take cover."
    "A rainbow appears, will you walk on it to find a pot of gold? Or has your luck run out."
]
